ilmo2/app/controllers/courses_controller.rb

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM `courses` WHERE (`courses`.`id` = 1)