ilmo2/app/controllers/users_controller.rb

INSERT INTO `users` (`studentid`, `updated_at`, `username`, `password`, `realname`, `created_at`) VALUES(NULL, '2009-11-18 22:06:54', 'testi2', 'testi', NULL, '2009-11-18 22:06:54')
---
  def create
    @user = User.new params[:user]
    if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `realname` = 'testi ukko', `password` = '', `updated_at` = '2009-11-19 12:52:28' WHERE `id` = 7
---
  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])