app/controllers/admin/mailer_controller.rb

SELECT * FROM `exercise_groups`
---
  def show
    @ex_groups = ExerciseGroup.all

SELECT * FROM `users` WHERE (email IS NOT NULL)
---
  def create
    users = User.with_email

    #ex_group = ExerciseGroup.find(params[:exercise_group])
    #registrations_in_this_group = Registration.find(:all,
    #      :conditions [ "exercise_group_id = ?", ex_group])

    #registrations_in_this_group.each do |u|

    users.each do |u|