app/controllers/course_instances_controller.rb

    def show
      @course_ins = CourseInstance.find(params[:id])
      @course = Course.find(CourseInstance.find(params[:id]).course_id)
---
SELECT * FROM `course_instances` WHERE (`course_instances`.`id` = 3)
SELECT * FROM `courses` WHERE (`courses`.`id` = 3)