app/controllers/courses_controller.rb

SELECT * FROM `newsfeeds` ORDER BY created_at DESC
SELECT * FROM `categories`
---
  def index
    @user = User.new
    @latest_newsfeed = Newsfeed.latest
    @courses = Course.courses_in_order_by_name
    @categories = Category.all

SELECT * FROM `courses` WHERE (`courses`.`id` = 1)
---
  def show
    @course = Course.find(params[:id])