app/controllers/exercise_groups_controller.rb

  def show
    @user = User.find(session[:user_id])
    @ex_group = ExerciseGroup.find(params[:id])
    @registration = Registration.find (:all,:conditions=>["user_id=? AND exercise_group_id=?",@user,@ex_group])
---
SELECT * FROM `users` WHERE (`users`.`id` = 11)
SELECT * FROM `exercise_groups` WHERE (`exercise_groups`.`id` = 1)
SELECT * FROM `registrations` WHERE (`registrations`.`exercise_group_id` IS NULL) AND (`registrations`.user_id = 11) LIMIT 1