app/controllers/friendships_controller.rb

  def create
    friend = User.find(params[:friend_id])
    friendship = current_user.friendships.build :user_id => current_user.id,
      :friend_id => friend.id

    if friendship.save
---
SELECT * FROM `users` WHERE (`users`.`id` = 14)
INSERT INTO `friendships` (`updated_at`, `user_id`, `friend_id`, `created_at`) VALUES('2009-12-10 17:19:51', 11, 14, '2009-12-10 17:19:51')

  def destroy
    friendship = current_user.friendships.find_by_friend_id(params[:friend_id])
    friendship.destroy

    friend = User.find(params[:friend_id])
---
SELECT * FROM `friendships` WHERE (`friendships`.`friend_id` = '14') AND (`friendships`.user_id = 11) LIMIT 1
DELETE FROM `friendships` WHERE `id` = 3
SELECT * FROM `users` WHERE (`users`.`id` = 11)