app/controllers/registrations_controller.rb

SELECT * FROM `exercise_groups` WHERE (`exercise_groups`.`id` = 1)
INSERT INTO `registrations` (`updated_at`, `exercise_group_id`, `user_id`, `created_at`) VALUES('2009-12-02 16:50:07', 1, 11, '2009-12-02 16:50:07')
---
  def create
    ex_group = ExerciseGroup.find(params[:ex_group_id])
    registration = current_user.registrations.build :exercise_group_id => ex_group.id

    if registration.save

SELECT * FROM `registrations` WHERE (`registrations`.`exercise_group_id` IS NULL) AND (`registrations`.user_id = 11) LIMIT 1
DELETE FROM `registrations` WHERE `id` = 10
---
  def index
  #def destroy
    registration = current_user.registrations.find_by_exercise_group_id(params[:ex_group_id])
    registration.destroy