app/controllers/registrations_controller.rb

  def destroy
    registration = current_user.registrations.find_by_exercise_group_id(params[:ex_group_id])
    registration.destroy
---
SELECT * FROM `registrations` WHERE (`registrations`.`exercise_group_id` IS NULL) AND (`registrations`.user_id = 11) LIMIT 1
DELETE FROM `registrations` WHERE `id` = 8