app/controllers/registrations_controller.rb

  def create
    @user_id = params[:user_id]
    @ex_group_id = params[:exercise_group_id]
    @registration = Registration.create :user_id => @user_id,
                        :exercise_group_id => @ex_group_id

    @user = User.find(@user_id)
---
SELECT * FROM `users` WHERE (`users`.`id` = 11)

  def destroy
    @registration = Registration.find(params[:id])
---
SELECT * FROM `registrations` WHERE (`registrations`.`id` = 8)