app/controllers/users_controller.rb

  def create
    @user = User.new params[:user]
    if @user.save
---
INSERT INTO `users` (`studentid`, `updated_at`, `username`, `password`, `realname`, `created_at`) VALUES(NULL, '2009-11-18 22:06:54', 'testi2', 'testi', NULL, '2009-11-18 22:06:54')

  def update
    @user = User.find(params[:id])

    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
UPDATE `users` SET `realname` = '', `password` = '', `updated_at` = '2009-11-26 19:20:49', `studentid` = 456 WHERE `id` = 11

  def destroy
    @user = User.find(params[:id])
    @user.destroy
---
SELECT * FROM `users` WHERE (`users`.`id` = 3)
DELETE FROM `users` WHERE `id` = 3